[
    {
        "semver": "4.1.2",
        "date": "2025-10-27T13:42:59.647Z",
        "image": "urbancode/ucv-ext-ucd:4.1.2",
        "notes": [
            "Enhancement: Added the integrationId field to the deployments collection for deployment records.",
            "Bug Fix: Resolved an issue in delta sync where in-progress APRs were not being tracked.",
            "Enhancement: Introduced new schedule events in UCD AppCompRequests, AppResources, and SnapCompVersions to synchronize Application Component Requests, Application Resources, and Snapshot Component Versions.",
            "Bug fix: Resolved an issue where manual deployments triggered from UrbanCode Velocity (UCV) failed with a 401 Unauthorized error, while scheduled releases continued to run successfully. This occurred due to an authentication failure between Velocity and UrbanCode Deploy (UCD) following a version upgrade. The integration credentials between UCV and UCD have been revalidated, and authentication handling has been improved to ensure successful manual deployments.",
            "Bug fix: Addressed an issue where applications created from older templates in UrbanCode Deploy (UCD) were not synchronizing correctly with UrbanCode Velocity (UCV). This issue prevented deployments from being initiated through Velocity, requiring manual execution in UCD. The synchronization logic has been enhanced so that processes and environments for newly created applications (based on existing templates) are now accurately captured during deltaSync."
        ],
        "supports": "5.1.9"
    },
    {
        "semver": "4.1.1",
        "date": "2025-08-29T06:29:39.186Z",
        "image": "urbancode/ucv-ext-ucd:4.1.1",
        "notes": [
            "<b>Enhancement</b>: Added teamId and teamspaceId field to application collection for data access control feature."
        ],
        "supports": "5.1.9"
    },
    {
        "semver": "4.0.9",
        "date": "2024-07-15T12:06:55.246Z",
        "image": "urbancode/ucv-ext-ucd:4.0.9",
        "notes": [
            "Releasing again for prev version changes"
        ],
        "supports": "4.0.13"
    },
    {
        "semver": "4.0.8",
        "date": "2024-07-15T08:14:04.441Z",
        "image": "urbancode/ucv-ext-ucd:4.0.8",
        "notes": [
            "Releasing again for prev version changes"
        ],
        "supports": "4.0.13"
    },
    {
        "semver": "4.0.7",
        "date": "2024-07-12T14:39:16.071Z",
        "image": "urbancode/ucv-ext-ucd:4.0.7",
        "notes": [
            "In this version automation task execution mechanism got modified. Previously we used to do completion of task during sync event. Now during execution of automation task, completion of task happens. It is helpful for giving exact user to the devops velocity and makes the execution faster. <b>Build Polling Timeout</b> as a new parameter is added in the plugin which indicates <b>Length of time (in minutes) to wait for build to complete if task is set to wait</b>. User can customize the <b>Build Polling Timeout</b> as per the need. Along with that a property which is a wait property is added. During the addition of task, wait property is in true state by default. It indicates plugin will wait for build to complete. If it explicitly set to false, then plugin will not for build to complete."
        ],
        "supports": "4.0.13"
    },
    {
        "semver": "4.0.6",
        "date": "2024-07-10T14:39:17.536Z",
        "image": "urbancode/ucv-ext-ucd:4.0.6",
        "notes": [
            "In this version, no need to add automatedTaskRunner manually to ucd server. It will ease of work for schedule deployment and auto promotion by reducing manual intervention."
        ],
        "supports": "4.0.13"
    },
    {
        "semver": "4.0.5",
        "date": "2024-05-20T10:35:39.429Z",
        "image": "urbancode/ucv-ext-ucd:4.0.5",
        "notes": [
            "<b>Minor bug fix:</b> In previous version user who does not exist on UCD server were able to execute the task. Now User who exists on UCD Server and have sufficient permission is able to execute the task."
        ],
        "supports": "4.0.13"
    },
    {
        "semver": "4.0.4",
        "date": "2024-04-10T09:04:35.423Z",
        "image": "urbancode/ucv-ext-ucd:4.0.4",
        "notes": [
            "<b>Rebranding</b>: Name of the plugin is changed from UrbanCode Deploy to IBM DevOps Deploy. "
        ],
        "supports": "4.0.13"
    },
    {
        "semver": "4.0.3",
        "date": "2023-11-29T10:29:48.201Z",
        "image": "urbancode/ucv-ext-ucd:4.0.3",
        "notes": [
            "Started uploading statuses to Snapshot and Component versions"
        ],
        "supports": "4.0.13"
    },
    {
        "semver": "4.0.2",
        "date": "2023-09-18T11:02:34.803Z",
        "image": "urbancode/ucv-ext-ucd:4.0.2",
        "notes": [
            "Using version properties for mapping build.url parameter"
        ],
        "supports": "4.0.13"
    },
    {
        "semver": "3.4.6",
        "date": "2023-06-09T12:02:37.877Z",
        "image": "urbancode/ucv-ext-ucd:3.4.6",
        "notes": [
            "Removed Version as mandatory for external UCD"
        ]
    },
    {
        "semver": "3.4.5",
        "date": "2023-04-10T12:28:22.349Z",
        "image": "urbancode/ucv-ext-ucd:3.4.5",
        "notes": [
            "<b>Bug Fix</b>: In previous version - plugin was not syncing more than 100 applications and it was resulting in Snapshot Upload failure.",
            "<b>Sync All Applications at First Sync</b>: Now UCD plugin is syncing all the applications, environments, processes, and components data even if an initial sync date is given.",
            "<b>Deployment Plan Fix</b>: In previous version of plugin deployment plan was not getting completed if we have parallel and sequential tasks with UCD app.",
            "<b>Removing Deleted Applications</b>: In the previous version of plugin the deleted Application processes were also available while selecting the process in the pipeline."
        ]
    },
    {
        "semver": "3.3.56",
        "date": "2023-02-21T09:59:16.880Z",
        "image": "urbancode/ucv-ext-ucd:3.3.56",
        "notes": [
            "<b>Removed UrbanCode Deploy Status Task</b>: Assign status task is removed and made part of main UrbanCode Deploy Task as post deployment success or failure step for assigning Snapshot or Component Version status."
        ]
    },
    {
        "semver": "2.3.52",
        "date": "2023-01-13T09:46:53.260Z",
        "image": "urbancode/ucv-ext-ucd:2.3.52",
        "notes": [
            "<b>Internal Server Error Fix</b>: The urbancode deploy plugin was giving internal server error while syncing the application processes from the UCD server."
        ]
    },
    {
        "semver": "2.3.51",
        "date": "2022-12-23T16:49:35.953Z",
        "image": "urbancode/ucv-ext-ucd:2.3.51",
        "notes": [
            "Major Enhancements"
        ]
    },
    {
        "semver": "1.0.16",
        "date": "2022-12-06T09:55:57.676Z",
        "image": "urbancode/ucv-ext-ucd:1.0.16",
        "notes": [
            "<b>Corrected incorrectly spelled plugin name</b>: In urbancode deploy plugin, display name was incorrectly spelled as Ubrancode deploy. Now corrected to Urbancode deploy."
        ]
    },
    {
        "semver": "1.0.12",
        "date": "2022-08-01T02:15:08.272Z",
        "image": "urbancode/ucv-ext-ucd:1.0.12",
        "notes": [
            "Importing failed application deployment history"
        ]
    },
    {
        "semver": "1.0.11",
        "date": "2022-07-25T07:43:31.896Z",
        "image": "urbancode/ucv-ext-ucd:1.0.11",
        "notes": [
            "Using Auto-generated User Access Key"
        ]
    },
    {
        "semver": "1.0.10",
        "date": "2022-07-24T22:26:51.686Z",
        "image": "urbancode/ucv-ext-ucd:1.0.10",
        "notes": [
            "Internal release related changes"
        ]
    }
]