[
    {
        "semver": "1.1.5",
        "date": "2025-11-06T09:17:43.793Z",
        "image": "urbancode/ucv-ext-build:1.1.5",
        "notes": [
            "Support update: From this version onward, Build plugin needs Velocity version 5.1.11 or later."
        ],
        "supports": "5.1.11"
    },
    {
        "semver": "1.1.4",
        "date": "2025-10-27T07:26:05.136Z",
        "image": "urbancode/ucv-ext-build:1.1.4",
        "notes": [
            "Enhancement: Added the integrationId field to the builds collection for build records."
        ],
        "supports": "5.1.9"
    },
    {
        "semver": "1.1.3",
        "date": "2025-10-06T09:17:21.183Z",
        "image": "urbancode/ucv-ext-build:1.1.3",
        "notes": [
            "<b>Enhancement</b>: Introduced support for an optional process field in the plugin configuration. This field allows users to provide a comma-separated list of primary process names corresponding to the order of the specified project names. If left empty the plugin will consider build life data from all processes associated with the given projects.",
            "<b>Bug Fix</b>: Previously revision data in the builds collection was captured only for builds triggered automatically through CI/CD and was missing for manually triggered builds . This issue has now been resolved and revision data is correctly collected for both manual and automated builds."
        ],
        "supports": "5.1.9"
    },
    {
        "semver": "1.1.2",
        "date": "2025-08-29T13:16:02.393Z",
        "image": "urbancode/ucv-ext-build:1.1.2",
        "notes": [
            "<b>Enhancement</b>: Added teamId and teamspaceId in application collection for data access control"
        ],
        "supports": "5.1.9"
    },
    {
        "semver": "1.0.3",
        "date": "2025-07-13T06:26:32.294Z",
        "image": "urbancode/ucv-ext-build:1.0.3",
        "notes": [
            "<b>Plugin name update</b>: Renamed plugin from IBM DevOps Build to DevOps Build."
        ],
        "supports": "5.1.0"
    },
    {
        "semver": "1.0.2",
        "date": "2025-06-06T09:54:38.130Z",
        "image": "urbancode/ucv-ext-build:1.0.2",
        "notes": [
            "<b>Initial release</b>: This is the first release of the DevOps Build plug-in for HCL DevOps Velocity. The plug-in facilitates integration between DevOps Build and HCL DevOps Velocity, providing enhanced visibility into build processes within CI/CD pipelines."
        ],
        "supports": "5.1.0"
    }
]